In [140]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pyspark as ps

In [141]:
spark = (ps.sql.SparkSession
         .builder
         .master('local[4]')
         .appName('lecture')
         .getOrCreate()
        )
sc = spark.sparkContext

In [142]:
sdf = spark.read.csv('../36361-0001-Data.tsv', sep=r'\t', header=True)

In [143]:
sdf.createOrReplaceTempView('nhis2014')
# df.printSchema()

In [144]:
query = '''
SELECT 
    CASEID,
    NEWRACE2,
    IRSEX,
    CATAGE,
    STMFLAG,
    STMRX1D2
FROM nhis2014
WHERE STMFLAG = 1
'''
sdf_sql = spark.sql(query)

In [145]:
df = sdf_sql.toPandas()

In [146]:
df['NEWRACE2'].unique()

array(['7', '1', '2', '3', '6', '5', '4'], dtype=object)

In [147]:
df['NEWRACE2'].value_counts()

1    3052
7     409
6     161
2     157
3      86
5      75
4      15
Name: NEWRACE2, dtype: int64

In [148]:
d = {1:'White',2:'Black',3:'Native American',4:'Native Hawaiian / Pacific Islander',5:'Asian',6:'More than one race',7:'Hispanic'}

In [149]:
df = df.astype(str).astype(int)

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3955 entries, 0 to 3954
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CASEID    3955 non-null   int64
 1   NEWRACE2  3955 non-null   int64
 2   IRSEX     3955 non-null   int64
 3   CATAGE    3955 non-null   int64
 4   STMFLAG   3955 non-null   int64
 5   STMRX1D2  3955 non-null   int64
dtypes: int64(6)
memory usage: 185.5 KB

In [153]:
df['NEWRACE2'] = df['NEWRACE2'].replace([1,2,3,4,5,6,7],['White','Black','Native American','Native Hawaiian / Pacific Islander','Asian','More than one race','Hispanic'])

In [154]:
df.head()

   CASEID  NEWRACE2  IRSEX  CATAGE  STMFLAG  STMRX1D2
0       3  Hispanic      2       3        1         3
1      18     White      1       4        1         3
2      19  Hispanic      1       4        1         3
3      35     White      2       1        1         3
4      42     White      2       4        1         3

In [155]:
def column_value_conv(df,colname,val_lst,repl_lst):
    df[colname] = df[colname].replace(val_lst,repl_lst)
    return df.head()